{"pages":[],"posts":[{"title":"bandit 워게임 level1 풀이","text":"Level Goal The password for the next level is stored in a file called - located in the home directory 다음 레벨의 비밀번호는 홈 디렉토리에 있는 - 라는 파일에 저장되어있다. 파일안에 있는 내용을 보기 위해 cat명령어를 사용하여 내용을 출력한다. cat ./- level2의 패스워드를 찾았다! CV1DtqXWVFXTvM2F0k09SHz0YwRINYA9","link":"/2021/12/07/bandit1/"},{"title":"bandit 워게임 level2 풀이","text":"Level Goal The password for the next level is stored in a file called spaces in this filename located in the home directory 다음 레벨의 비밀번호는 홈 디렉토리에 있는 spaces in this filename이라는 파일에 저장되어있다. 파일 이름에 공백(스페이스)가 있거나 넣고 싶은 경우는 **\\(역슬래시)**를 사용한다. cat ./spaces\\ in\\ this\\ filename (tab키를 치면 쉽다) level3의 패스워드를 찾았다! UmHadQclWmgdLOKQ3YNgjWxGoRMb5luK","link":"/2021/12/07/bandit2/"},{"title":"bandit 워게임 level3 풀이","text":"Level Goal The password for the next level is stored in a hidden file in the inhere directory. 다음 레벨의 비밀번호는 inhere 디렉토리의 숨겨진 파일에 저장되어있다. 숨겨진 파일은 ls명령어로는 출력되지 않는다. 숨겨진 파일을 출력하기 위해선 -a라는 옵션을 추가한다. -a : 숨겨진 파일이나 디렉토리도 출력한다.-A : .와 .는 제외하고 출력 ls -a 여기서 제일 숨겨진 파일같은 것을 출력해본다. cat .hidden level4의 패스워드를 찾았다! pIwrPrtPN36QITSp3EQaw936yaFoFgAB","link":"/2021/12/07/bandit3/"},{"title":"bandit 워게임 level4 풀이","text":"Level Goal The password for the next level is stored in the only human-readable file in the inhere directory. Tip: if your terminal is messed up, try the “reset” command. 다음 레벨의 비밀번호는 inhere 디렉토리에서 사람이 읽을 수 있는 유일한 파일에 저장됩니다. 팁: 터미널이 엉망이면 “재설정” 명령을 시도하십시오. inhere디렉토리에 들어가 어떤 파일이 있는지 확인한다. 2가지 방법으로 풀수 있다. 첫번째 방법 : 전부다 출력!이 디렉토리에 있는 10개의 파일을 하나씩 내용을 출력 해본다. 대부분 파일의 내용이 이상한 형태로 출력되었지만 -file07의 내용만이 우리가 알수 있는 형태로 출력되었다. (터미널이 어지럽게 있다면 clear라는 명령어를 사용하면 깔끔해진다.) 아마 이것이 패스워드인것 같다. 두번째 방법 : 파일의 타입을 확인!file이라는 명령어는 파일의 타입을 확인하는 명령어이다. file ./* : 이 디렉토리에 있는 모든 파일의 타입을 출력 여기서 혼자만 ASCII TEXT타입을 가진 파일**-file07**이 정답일 확률이 높다. level5의 패스워드를 찾았다! koReBOKuIDDepwhWk7jZC0RTdopnAYKh","link":"/2021/12/07/bandit4/"},{"title":"bandit 워게임 level5 풀이","text":"Level Goal The password for the next level is stored in a file somewhere under the inhere directory and has all of the following properties: human-readable1033 bytes in sizenot executable 다음 레벨의 비밀번호는 inhere 디렉토리 아래 어딘가에 있는 파일에 저장되며 다음 속성을 모두 갖습니다. 사람이 읽을 수 있는 1033바이트 크기 실행 불가 inhere디렉토리에 들어가 어떤 파일이 있는지 확인한다. 20개의 디렉토리가 나왔다. level4에서 사용했던 방법을 사용할순 있지만 매우 번거러울 것 같다. 힌트를 더 살펴보면 1033바이트 크기의 파일이라는 정보를 얻을 수 있다. 이 정보를 토대로 검색을 하면 빠르게 파일을 찾을 수 있을 것 같다. find라는 명령어를 사용하여 크기가 1033바이트인 파일을 검색하면 된다. file 명령어 옵션중 -size을 사용하면 된다. file . -size 1033c (현재 디렉토리에서 크기가 1033바이트인 파일 검색) 사이즈 단위 b : 블록단위 c : 바이트 (byte) k : 킬로바이트 (kilobyte) w : 2바이트 워드 (2 byte word) m : 메가 바이트 (megabyte) g : 기가 바이트 (gigabyte) level6의 패스워드를 찾았다! DXjZPULLxYr17uwoI01bNLQbtFemEgo7","link":"/2021/12/07/bandit5/"},{"title":"bandit 워게임 level6 풀이","text":"Level Goal The password for the next level is stored somewhere on the server and has all of the following properties: owned by user bandit7owned by group bandit633 bytes in size 다음 레벨의 비밀번호는 서버의 어딘가에 저장되며 다음 속성을 모두 갖는다. 사용자 bandit7 소유 bandit6 그룹 소유 33바이트 크기 저번처럼 find명령어를 이용하여 파일을 찾는다. find / -user bandit7 -group bandit6 -size 33c (최상위 디렉토리에서 사용자가 bandit7 그룹이 bandit6 사이즈가 33바이트인 파일 검색) 조건에 부합하는 여러 파일들이 많이 있지만 거의 모든 것이 권한 거부(Permission denied)가 되어있다.하지만 단 하나의 파일만이 권한 거부가 없다. cat /var/lib/dpkg/info/bandit7.password level7의 패스워드를 찾았다! HKBPTKQnIay4Fw76bEy8PVxKEDQRKTzs","link":"/2021/12/07/bandit6/"},{"title":"bandit 워게임 level7 풀이","text":"Level Goal The password for the next level is stored in the file data.txt next to the word millionth 다음 레벨의 비밀번호는 millionth라는 단어 옆에 있는 data.txt 파일에 저장되어있다. grep 명령어를 이용하여 파일 내의 문자열을 검색한다. grep ‘millionth*’ ./data.txt (data.txt 파일 내에 millionth 다음 문자열 검색) level8의 패스워드를 찾았다! cvX2JJa4CFALtqS87jk27qwqGhBM9plV","link":"/2021/12/07/bandit7/"},{"title":"bandit 워게임 level8 풀이","text":"Level Goal The password for the next level is stored in the file data.txt and is the only line of text that occurs only once 다음 레벨의 암호는 data.txt 파일에 저장되며 한 번만 나타나는 텍스트의 유일한 줄이다. 요약하자면 중복되지 않은 유일한 문장을 찾아야한다. data.txt의 내용을 보면 무수히 문장의 암호가 출력된다. 이 중 중복되지 않은 문장을 uniq출력하면 될 것 같다.하지만 연속적인 중복만 제거하므로 sort로 정렬해주어야한다. sort와uniq 명령어를 동시에 사용하여 문자열을 출력한다. cat data.txt | sort | uniq -u (data.txt의 각 줄을 내림차순으로 정렬하고 중복된 줄을 제거한 뒤 출력) level9의 패스워드를 찾았다! UsvVyFSfZZWbi6wgC7dAFyFuR6jQQUhR","link":"/2021/12/07/bandit8/"},{"title":"bandit 워게임 level9 풀이","text":"Level Goal The password for the next level is stored in the file data.txt in one of the few human-readable strings, preceded by several ‘=’ characters. 다음 레벨의 비밀번호는 몇 개의 ‘=’ 문자가 앞에 오는 사람이 읽을 수 있는 몇 가지 문자열 중 하나로 data.txt 파일에 저장된다. data.txt의 내용을 보면 이해할 수 없는 문자들로 난잡하다. 이를 string명령어를 사용하여 사람이 읽을 수 있는 **문자(ASCII)**를 추출하여 출력하면 된다. strings data.txt 이를 실행하고 나면 아까 나온 힌트대로 = 앞에 오는 문자열을 찾을 수 있다. level10의 패스워드를 찾았다! truKLdjsbJ5g7yyJ2X2R0o3a5HQJFuLk","link":"/2021/12/07/bandit9/"},{"title":"bandit 워게임 level10 풀이","text":"Level Goal The password for the next level is stored in the file data.txt, which contains base64 encoded data 다음 레벨의 비밀번호는 base64로 인코딩된 데이터가 포함된 data.txt 파일에 저장되어있다. data.txt의 내용이 base64로 인코딩되어 있다. 이를 base64명령어로 다시 디코딩 하면 될것 같다. base64 -d data.txt 옵션 설명 없음 base64로 인코딩 -d base64로 된 데이터 디코딩 -i 디코딩 할 때, 알파벳이 아닌 문자 무시 level11의 패스워드를 찾았다! IFukwKGsFW8MOq3IRFqrxE1hxTNEbUPR","link":"/2021/12/07/bandit10/"},{"title":"bandit 워게임 level11 풀이","text":"Level Goal The password for the next level is stored in the file data.txt, where all lowercase (a-z) and uppercase (A-Z) letters have been rotated by 13 positions 다음 레벨의 비밀번호는 data.txt 파일에 저장됩니다. 여기서 모든 소문자(a-z) 및 대문자(A-Z)가 13자리 회전되어있다. data.txt의 내용이 13자리씩 밀려 있다.A는 N이 되고 B는 O, C는 P… 13자리씩 밀려 있으니 다시 13번 밀면 다시 원점으로 돌아온다.(알파벳은 25자리) tr명령어를 사용한다. cat data.txt | tr ‘A-Za-z’ ‘N-ZA-Mn-za-m’ level12의 패스워드를 찾았다! 5Te8Y4drgCRfCx8ugdwuEX8KFC6k2EUu","link":"/2021/12/07/bandit11/"},{"title":"bandit 워게임 level12 풀이","text":"Level Goal The password for the next level is stored in the file data.txt, which is a hexdump of a file that has been repeatedly compressed. For this level it may be useful to create a directory under /tmp in which you can work using mkdir. For example: mkdir /tmp/myname123. Then copy the datafile using cp, and rename it using mv (read the manpages!) 다음 레벨의 비밀번호는 반복적으로 압축된 파일의 16진 덤프인 data.txt 파일에 저장됩니다. 이 수준의 경우 아래에 디렉터리를 만드는 것이 유용할 수 있다. /tmp에서 mkdir을 사용하여 작업할 수 있습니다. 예: mkdir /tmp/myname123. 그런 다음 cp를 사용하여 데이터 파일을 복사하고 mv를 사용하여 이름을 바꿉니다(맨페이지 읽기!) 노가다 주의!!!!data.txt의 내용이 16진수로 덤프되어있다.일단 /tmp에 아무 디렉토리를 만들고 data.txt를 복사해온다. xxd명령어를 사용하여 16진수 데이터를 바이너리 데이터로 변환한다. xxd -r data.txt data file을 이용해 속성값을 확인하다. 데이터는 gzip으로 압축되었다고한다.data의 확장자를 gz로 바꾸고 압축을 푼다. 속성값을 다시 확인하니 bzip2으로 압축되었다고 한다.data의 확장자를 bz로 바꾸고 압축을 푼다. 속성값을 다시 확인하니 gzip으로 압축되었다고 한다.data의 확장자를 gz로 바꾸고 압축을 푼다. 속성값을 다시 확인하니 tar으로 묶여있다data의 확장자를 tar로 바꾸고 푼다. data5.bin의 속성을 확인하니 tar으로 묶여있다data의 확장자를 tar로 바꾸고 푼다. 속성값을 다시 확인하니 bzip2으로 압축되었다고 한다.data의 확장자를 bz로 바꾸고 압축을 푼다. data6의 속성을 확인하니 tar으로 묶여있다data의 확장자를 tar로 바꾸고 푼다. 속성값을 다시 확인하니 gzip으로 압축되었다고 한다.data의 확장자를 gz로 바꾸고 압축을 푼다. 드디어 길고길었던 노가다가 끝났다.level13의 패스워드를 찾았다! 8ZjyCRiBWFYkneahHwxCv3wb2a1ORpYL","link":"/2021/12/07/bandit12/"},{"title":"bandit 워게임 level13 풀이","text":"Level Goal The password for the next level is stored in /etc/bandit_pass/bandit14 and can only be read by user bandit14. For this level, you don’t get the next password, but you get a private SSH key that can be used to log into the next level. Note: localhost is a hostname that refers to the machine you are working on 다음 레벨의 비밀번호는 /etc/bandit_pass/bandit14에 저장되며 bandit14 사용자만 읽을 수 있습니다. 이 수준의 경우 다음 암호를 얻지 못하지만 다음 수준에 로그인하는 데 사용할 수 있는 개인 SSH 키를 얻습니다. 참고: localhost는 작업 중인 시스템을 나타내는 호스트 이름이다. 파일 이름을 보니 ssh 비밀키 인것 같다. 비밀키가 별도의 저장소에 저장되어 있다.그럴 때에는 -i 옵션을 사용하여 경로를 지정하면 된다. ssh -i sshkey.private bandit14@localhost bandit14계정에 접속하였다. level14의 패스워드를 찾았다! 4wcYUJFw0k0XLShlDzztnTBHiqxU3b3e","link":"/2021/12/07/bandit13/"},{"title":"bandit 워게임 level14 풀이","text":"Level Goal The password for the next level can be retrieved by submitting the password of the current level to port 30000 on localhost. 다음 수준의 암호는 현재 수준의 암호를 localhost의 포트 30000에 제출하여 검색할 수 있다. ssh로 30000포트에 접속시도 했을땐 접속이 거부당한다. ssh -p 30000 localhost 아마 telnet으로 접속해야 될것 같다. telnet localhost 30000 비번은 14레벨 암호를 치면 된다. 4wcYUJFw0k0XLShlDzztnTBHiqxU3b3e level15의 패스워드를 찾았다! BfMYroe26WYalil77FoDi9qh59eK5xNr","link":"/2021/12/07/bandit14/"},{"title":"bandit 워게임 level15 풀이","text":"Level Goal The password for the next level can be retrieved by submitting the password of the current level to port 30001 on localhost using SSL encryption.Helpful note: Getting “HEARTBEATING” and “Read R BLOCK”? Use -ign_eof and read the “CONNECTED COMMANDS” section in the manpage. Next to ‘R’ and ‘Q’, the ‘B’ command also works in this version of that command… 다음 레벨의 비밀번호는 SSL 암호화를 사용하여 localhost의 포트 30001에 현재 레벨의 비밀번호를 제출하여 검색할 수 있습니다. 도움이 되는 메모: “HEARTBEATING” 및 “Read R BLOCK”이 필요하십니까? -ign_eof를 사용하고 맨페이지의 “CONNECTED COMMANDS” 섹션을 읽으십시오. ‘R’ 및 ‘Q’ 옆에 ‘B’ 명령은 해당 명령의 이 버전에서도 작동합니다… s_client는 SSL/TLS를 사용하는 원격 호스트에 접속하기 위한 SSL/TLS client를 구현하는 명령어이다. openssl s_client -connect localhost:30001 telnet localhost 30000 비번은 15레벨 암호를 치면 된다. BfMYroe26WYalil77FoDi9qh59eK5xNr level16의 패스워드를 찾았다! cluFn7wTiGryunymYOu4RcffSxQluehd","link":"/2021/12/07/bandit15/"},{"title":"bandit 워게임 level16 풀이","text":"Level Goal The credentials for the next level can be retrieved by submitting the password of the current level to a port on localhost in the range 31000 to 32000. First find out which of these ports have a server listening on them. Then find out which of those speak SSL and which don’t. There is only 1 server that will give the next credentials, the others will simply send back to you whatever you send to it. 다음 레벨의 자격 증명은 현재 레벨의 비밀번호를 31000 ~ 32000 범위의 localhost 포트에 제출하여 검색할 수 있습니다. 먼저 이러한 포트 중 서버가 수신 대기하는 포트를 찾으십시오. 그런 다음 SSL을 사용하는 것과 그렇지 않은 것을 찾으십시오. 다음 자격 증명을 제공할 서버는 1개뿐이며 나머지 서버는 귀하가 보내는 모든 것을 다시 귀하에게 보냅니다. nmap을 통해 31000~32000범위의 포트 중 열려 있는 포트를 찾는다 nmap -p 31000-32000 localhost 4개의 포트가 나왔다.일단 전부다 ssl 연결을 하여 ssl을 사용하고 있는지 확인한다. openssl s_client -connect localhost:[포트번호] 31790 포트만이 레벨 16의 패스워드를 입력했을때 비밀키를 반환한다. cluFn7wTiGryunymYOu4RcffSxQluehd 비밀키를 복사해서 /tmp 디렉토리에 파일을 만들고 복사한다. (예전에 tmp에 파일이나 디렉토리를 만들수 있다는 힌트가 있었음) —–BEGIN RSA PRIVATE KEY—–MIIEogIBAAKCAQEAvmOkuifmMg6HL2YPIOjon6iWfbp7c3jx34YkYWqUH57SUdyJimZzeyGC0gtZPGujUSxiJSWI/oTqexh+cAMTSMlOJf7+BrJObArnxd9Y7YT2bRPQJa6Lzb558YW3FZl87ORiO+rW4LCDCNd2lUvLE/GL2GWyuKN0K5iCd5TbtJzEkQTuDSt2mcNn4rhAL+JFr56o4T6z8WWAW18BR6yGrMq7Q/kALHYW3OekePQAzL0VUYbWJGTi65CxbCnzc/w4+mqQyvmzpWtMAzJTzAzQxNbkR2MBGySxDLrjg0LWN6sK7wNXx0YVztz/zbIkPjfkU1jHS+9EbVNj+D1XFOJuaQIDAQABAoIBABagpxpM1aoLWfvDKHcj10nqcoBc4oE11aFYQwik7xfW+24pRNuDE6SFthOar69jp5RlLwD1NhPx3iBlJ9nOM8OJ0VToum43UOS8YxF8WwhXriYGnc1sskbwpXOUDc9uX4+UESzH22P29ovdd8WErY0gPxun8pbJLmxkAtWNhpMvfe0050vk9TL5wqbu9AlbssgTcCXkMQnPw9nCYNN6DDP2lbcBrvgT9YCNL6C+ZKufD52yOQ9qOkwFTEQpjtF4uNtJom+asvlpmS8AvLY9r60wYSvmZhNqBUrj7lyCtXMIu1kkd4w7F77k+DjHoAXyxcUp1DGL51sOmama+TOWWgECgYEA8JtPxP0GRJ+IQkX262jM3dEIkza8ky5moIwUqYdsx0NxHgRRhORT8c8hAuRBb2G82so8vUHk/fur85OEfc9TncnCY2crpoqsghifKLxrLgtT+qDpfZnxSatLdt8GfQ85yA7hnWWJ2MxF3NaeSDm75Lsm+tBbAiyc9P2jGRNtMSkCgYEAypHdHCctNi/FwjulhttFx/rHYKhLidZDFYeiE/v45bN4yFm8x7R/b0iE7KaszX+ExdvtSghaTdcG0Knyw1bpJVyusavPzpaJMjdJ6tcFhVAbAjm7enCIvGCSx+X3l5SiWg0AR57hJglezIiVjv3aGwHwvlZvtszK6zV6oXFAu0ECgYAbjo46T4hyP5tJi93V5HDiTtiek7xRVxUl+iU7rWkGAXFpMLFteQEsRr7PJ/lemmEY5eTDAFMLy9FL2m9oQWCgR8VdwSk8r9FGLS+9aKcV5PI/WEKlwgXinB3OhYimtiG2Cg5JCqIZFHxD6MjEGOiuL8ktHMPvodBwNsSBULpG0QKBgBAplTfC1HOnWiMGOU3KPwYWt0O6CdTkmJOmL8Niblh9elyZ9FsGxsgtRBXRsqXuz7wtsQAgLHxbdLq/ZJQ7YfzOKU4ZxEnabvXnvWkUYOdjHdSOoKvDQNWu6ucyLRAWFuISeXw9a/9p7ftpxm0TSgyvmfLF2MIAEwyzRqaM77pBAoGAMmjmIJdjp+Ez8duyn3ieo36yrttF5NSsJLAbxFpdlc1gvtGCWW+9Cq0bdxviW8+TFVEBl1O4f7HVm6EpTscdDxU+bCXWkfjuRb7Dy9GOtt9JPsX8MBTakzh3vBgsyi/sN3RqRBcGU40fOoZyfAMT8s1m/uYv52O6IgeuZ/ujbjY=—–END RSA PRIVATE KEY—– 레벨 13에서 했던것 처럼 경로를 잡아주고 ssh접속을 한다. 권한떄문에 접속이 거부 됬다. 파일의 권한을 700으로 바꿔서 시도한다. chmod 700 /tmp/private_key1231231123 다시 접속해 본다. 홈 디렉토리엔 파일이 2개 있지만 이것 level18를 가기 위한 파일인 것 같다. 각 패스워드 비번이 있는 /etc/bandit_pass에 들어가 패스워드 파일을 출력해 본다. level17의 패스워드를 찾았다! xLYVMN9WE5zQ5vHacb0sZEVqbrp7nBTn","link":"/2021/12/07/bandit16/"}],"tags":[{"name":"bandit","slug":"bandit","link":"/tags/bandit/"}],"categories":[]}